from sympy import Symbol, Matrix

# ускорение свободного падения
g = Symbol('g')

# радиус сферической оболочки
R = 0.081 #Symbol('R') # 16.2 cm diametr

# радиус колесика
r = 0.026 #Symbol('r')

# расстояние от т.O до т.B
l: Symbol = Symbol('l')

# масса сферической оболочки
M = 0.137 #Symbol('M') # 137.5 g ()

# масса платформы с установленными на ней приборами
M_p = 0.65 #Symbol('M_p') # 656 g

# масса колеса
m = 0.05 #Symbol('m')

# координаты ц.м. платформы по оси O_x1 , O_x2 и O_x3
C_Mx = Symbol('C_Mx')
C_My = Symbol('C_My')
C_Mz = Symbol('C_Mz')

# координаты ц.м. колеса по оси O_x1, O_x2 и O_x3
C_mx = Symbol('C_mx')
C_my = Symbol('C_my')
C_mz = Symbol('C_mz')

# радиус-вектор центра масс платформы в с.к. C_x1_x2_x3
R_cm_p = Matrix([[0],
                 [0],
                 [-0.01]])

# радиус-вектор центра масс колеса в с.к. C_x1_x2_x3
R_cm_w = Matrix([[0],
                 [0],
                 [-0.055]])

# моменты инерции платформы относитльно главных осей инерции
J_px = (M_p * 0.0635**2)/4 + M_p * 0.009**2  #Symbol('J_px')
J_py = (M_p * 0.0635**2)/4 + M_p * 0.009**2  #Symbol('J_py')
J_pz = (M_p * 0.0635**2)/2 #Symbol('J_pz')

# моменты инерции колеса относитльно главных осей инерции
J_wx = (m * r**2)/4 + m*5.5**2 #Symbol('J_wx')
J_wy = (m * r**2)/4 + m*5.5**2 #Symbol('J_wy')
J_wz = (m * r**2)/2   #Symbol('J_wz')

# тензор инерции для сферической оболочки
J_s = Matrix([[2/3 * M * R**2,   0,              0],
             [0,                 2/3 * M * R**2, 0],
             [0,                 0,              2/3 * M * R**2]])

# тензор инерции для платформы
J_p = Matrix([[J_px, 0,    0],
              [0,    J_py, 0],
              [0,    0,    J_pz]])

# тензор инерции колеса
J_w = Matrix([[J_wx, 0,     0],
              [0,    J_wy,  0],
              [0,    0,     J_wz]])

# J_w = Matrix([[m * r**2/4 + m * l**2, 0,                     0],
#               [0,                     m * r**2/2 + m * l**2, 0],
#               [0,                     0,                     m * r**2/4]])